In [1]:
from datasloth import DataSloth
sloth = DataSloth()

In [2]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [3]:
sloth.query("Average fare paid by men who traveled alone")

    avg_fare
0  16.713358

In [4]:
sloth.query("All first class women who did not survive")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,1,female,50.0,0,0,28.7125,C,First,woman,0,C,Cherbourg,no,1
1,0,1,female,2.0,1,2,151.5500,S,First,child,0,C,Southampton,no,0
2,0,1,female,25.0,1,2,151.5500,S,First,woman,0,C,Southampton,no,0